fixs bgs
